// напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя)
int numberA = 155;
// Console.WriteLin(numberA);
int result = numberA * numberA;
//Console.WriteLine(result);
Console.WriteLine($"квадрат числа {numberA} равен {result}");
